{
    "Information": {
        "Basic Info": [
            "**name**: Raul Beltran Gomez",
            "**github**: https://github.com/rb58853",
            "**bachelor**: Computer Science",
            "**university**: University of havana"
        ],
        "About ": "I am Raúl, a computer scientist with a solid background in mathematics. My specialty lies in the analysis and design of algorithms, combined with advanced skills in frontend and backend programming, which allows me to work as a full-stack developer. My experience extends to the application of machine learning techniques and artificial intelligence, with my thesis project being in this field.My methodological approach includes the use of agile methodologies such as Scrum and Kanban, which allows me to work efficiently and adaptably. I value the importance of maintaining clean, organized, and well-commented code, following the SOLID principles to ensure the quality, maintainability, and scalability of software.",
        "Interests": "My professional interests lean towards number theory, graph theory, and the development of solutions in the field of machine learning and artificial intelligence. I am open to working on projects that require both frontend and backend development, as well as game development, and I am committed to creating optimal solutions.",
        "Study fields ": [
            "Arificial intelligent and Machine Learning",
            "Information Retrieval Systems",
            "Compilers",
            "Operative Systems",
            "Databases and Sofware",
            "Engineering",
            "Distributed Systems",
            "Networks",
            "Data Structure Analysis and Algorithms",
            "Desing and analisis of algorithms",
            "Graph Theory",
            "Number Theory"
        ],
        "Languajes": [
            "Spanish (Native)",
            "Engish(A2)"
        ],
        "Knowledge": [
            "Graph Theory",
            "Number Theory",
            "Language Theory",
            "Dinamyc and Greedy Programing",
            "Combinatorics",
            "Algebra",
            "Data Structure Analysis and Algorithm"
        ]
    },
    "Programming languajes": [
        "**Python**: very high",
        "**C#**: very high",
        "**Javascript**: high",
        "**MIPS**: high",
        "**Jupyter Notebook**: high",
        "**Markdown**: high",
        "**CSS**: high",
        "**LaTex**: medium",
        "**Dart**: medium",
        "**HTML**: medium",
        "**C++**: low",
        "**Prolog**: low",
        "**C**: low"
    ],
    "Skills": {
        "ReactJs": [
            "**level**: high",
            "**info**: Domino bastante bien el framework de ReactJS teniendo creados aqui \nalgunos proyectos como es mi portafolio y otras paginas webs.",
            "**experience-time**: 5 months"
        ],
        "Artificial Inteligense: ": [
            "**level**: high",
            "**info**: Domino el campo de la inteligencia artificial basica, enfocandome mas en el uso de heuristicas y metaheuristicas",
            "**experience-time**: 1 years"
        ],
        "React Native: ": [
            "**level**: medium,",
            "**info**: He trabajado en algunos proyectos personales con React Native y me defiendo bien con esta herramienta ya que es muy parecida a ReactJS,",
            "**experience-time**: 1 month"
        ],
        "Simulation: ": [
            "**level**: medium",
            "**info**: Mi enfoque principal en este campo se basa en sistemas de agentes inteligentes y multiagentes",
            "**experience-time**: 3 months"
        ],
        "Machine Learning: ": [
            "**level**: very high",
            "**info**: He trabajado en proyectos relacionados con este campo como es el uso de LLMs de openAI. Tambien he aplicado estos conocimientos a la recuperacion de **info**rmacion usando embeddings. En cuanto a entrenamiento y creacion de modelos tengo experiencia en redes neuronales recurrentes, transformers o capas de atencion y en redes convlucionales. El enfoque principal que he usado en esta habilidad es sobre imagenes y lenguaje natural.",
            "**experience-time**: 2 years"
        ],
        ".Net ": [
            "**level**: medium",
            "**info**: He usado el ORM de .net para proyectos presonales sencillos y domino muy bien el lenguaje C# que se usa para este entorno.",
            "**experience-time**: 1 month"
        ],
        "Information Retrieval Systems": [
            "**level**: very high",
            "**info**: He trabajado en proyectos relacionados con este campo combinandolo con el uso de LLM y de embeddings. Estoy familiarizado con esta habilidad tanto con el uso de vectores generados (como embeddings) como con cualquier tipo de vector o recuperacion por terminos. Tambien conozco a la perfeccion estructuras de datos como TRIE para lograr la menor complejidad temporal en este tipo de problemas. Actualmente estoy trabajando en un proyecto OpenSource de este campo",
            "**experience-time**: 3 years"
        ],
        "Design and Analysis of Algorithms- **level**: very high": [
            "**info**:  El disenno y analisis de algoritmos es la habilidad basica de un cientifico de la computacion, estamos altamente preparados para disennar y analizar algoritmos exhaustivamente de forma efectiva y demostrable, logrando las mejores complejdades computacionales posibles para cada problema que surja.",
            "**experience-time**: 5 years"
        ],
        "compilers": "high",
        "distributed system": "medium",
        "Operating systems ": "medium",
        "networks": "low",
        "unity engine": "high",
        "django": "medium",
        "Telegram bot": "medium",
        "flutter": "medium"
    },
    "Socials": [
        "**Telegram**: @rb58853",
        "**Github**: ******",
        "**Phone**: ********"
    ],
    "projects": [
        {
            "title": "Image Retrieval System using Machine Learning",
            "keywords": [
                "Embeddings",
                "Multimodal Embeddings",
                "Image Retrieval",
                "Machine Learning",
                "AI",
                "Segment Anything Model",
                "CLIP Model",
                "Text-based Image Retrieval",
                "Positional Information",
                "Segmentation",
                "Indexing"
            ],
            "skills": [
                "IRS",
                "ML",
                "AI"
            ],
            "programming_languages": [
                "Python"
            ],
            "description": "In this project, the problem of precise image retrieval is addressed. The work employs a new approach: the application of the Segment Anything (SAM) segmentation models and the Constractive Language-Image Pretraining (CLIP) model for the generation of multimodal embeddings. Special emphasis is placed on image retrieval via precise queries, taking into account the position of image segments that compose the same, processing both text and images. This thesis project focuses on retrieving images using text as input. During indexing, embeddings of the image and its segmentations are created to achieve retrieval through positional information. The Meta SAM (Segment Anything Model) is used to segment images, and each segmentation generates a multimodal embedding using the OpenAI CLIP model, which generates embeddings for both images and text. Using all generated embeddings, both for images and the original image's segmentation, retrieval is performed by matching text against images.",
            "id": "IRSImagesCLIP"
        },
        {
            "title": "Development of Intelligent Navigation Systems in Dynamic Environments",
            "keywords": [
                "A*",
                "Artificial Intelligence",
                "Intelligent Navigation",
                "Agent Simulation",
                "NavMesh",
                "Pathfinding Algorithms",
                "Algorithm Optimization",
                "Metaheuristics",
                "Perception and Collision Detection",
                "Spatial Ordering",
                "Dynamic Environments",
                "Terrain",
                "Unity",
                "C#"
            ],
            "skills": [
                "Development of artificial intelligence algorithms",
                "Implementation of complex data structures with graphs",
                "Simulation of intelligent agents",
                "Optimization of search algorithms (A*, Real-Time A*)",
                "Implementation of perception, spatial ordering, and collision detection techniques",
                "Use of metaheuristics for algorithm optimization",
                "Development of real-time navigation systems"
            ],
            "programming_languages": [
                "C#"
            ],
            "description": "This project focuses on the creation of intelligent navigation systems for agents that interact with each other and are influenced by weather, seasonal, and terrain conditions. The main objective is to develop advanced algorithms to determine and simulate the optimal movements of these agents in complex and dynamically changing environments.",
            "id": "navMeshAgentAI"
        }
    ]
}